# HasStructuralDeck Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..HasStructuralDeck Property
CompoundStructure Class See Also
---
Checks if the compound structure has a structural deck.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool HasStructuralDeck { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasStructuralDeck As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasStructuralDeck {
	bool get ();
}
```

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace